# US - Baby Names

### Step 1 : Check the dataset shared

### Step 2. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

In [2]:
url='https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
url

'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

### Step 3. Assign it to a variable called baby_names.

In [3]:
babynames=pd.read_csv(url)
babynames.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [4]:
babynames.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
babynames=babynames.drop(columns=['Unnamed: 0','Id'])
babynames.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [7]:
babynames['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [9]:
names=babynames.groupby('Name').count() #when there is a group by you need to use aggregate functions(sum,mean,count...)
names

         Year  Gender  State  Count
Name
Aaban       2       2      2      2
Aadan       4       4      4      4
Aadarsh     1       1      1      1
Aaden     196     196    196    196
Aadhav      1       1      1      1
...       ...     ...    ...    ...
Zyra        7       7      7      7
Zyrah       2       2      2      2
Zyren       1       1      1      1
Zyria      10      10     10     10
Zyriah      9       9      9      9

[17632 rows x 4 columns]

### Step 8. How many different names exist in the dataset?

In [10]:
babynames.nunique()['Name']

17632

### Step 9. What is the name with most occurrences?

In [11]:
babynames['Name'].value_counts().index[0]

'Riley'

### Step 10. How many different names have the least occurrences?

In [17]:
babynames['Name'].value_counts().tail(3682)

Name
Grettell    1
Dawsen      1
Abenezer    1
Greenley    1
Daiden      1
           ..
Terryn      1
Yanna       1
Zemirah     1
Emmilyn     1
Coalton     1
Name: count, Length: 3682, dtype: int64

### Step 11. What is the median name occurrence?

In [19]:
babynames[babynames['Count']==babynames['Count'].median()]

                Name  Year Gender State  Count
71           Makayla  2004      F    AK     11
72             Maria  2004      F    AK     11
73              Mary  2004      F    AK     11
74          Michelle  2004      F    AK     11
259        Alexandra  2005      F    AK     11
...              ...   ...    ...   ...    ...
1016276  Christopher  2014      M    WY     11
1016277       Corbin  2014      M    WY     11
1016278        Gavin  2014      M    WY     11
1016279      Greyson  2014      M    WY     11
1016280       Isaiah  2014      M    WY     11

[36199 rows x 5 columns]

### Step 12. What is the standard deviation of names?

In [22]:
babynames['Count'].std()

97.39734648625934

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [26]:
babynames.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03